{
  "subtasks": [
    {
      "subtask_id": "10002",
      "description": "**Subtask: Implement Backend REST API Endpoint for Aggregated Student Career Pathway Engagement Metrics**\n\nTo enable real-time visualization of student career pathway engagement for coordinators, develop a secure REST API endpoint (`/api/career-pathways/engagement-metrics`) using Python with Flask. This endpoint should aggregate data from the enterprise LMS (Moodle) and HRIS (SAP SuccessFactors) by fetching and combining relevant student activity logs, skill development records, and learning outcome assessments. The API must process and normalize raw data, applying secondary school career pathway frameworks (e.g., Czech ISCED classifications) to categorize student progress, and return results in a format optimized for frontend chart rendering (e.g., JSON arrays grouped by pathway, skill, and cohort). Implement robust access control using OAuth2 or JWT, ensuring only authorized coordinator users can access aggregated data. Required technical skills include advanced Python (Flask, SQLAlchemy), RESTful API design, PostgreSQL (complex queries, data modeling), and experience with Docker for containerization. Domain expertise in pedagogy, secondary education career guidance frameworks, and data privacy in educational contexts is essential. Deliverables: fully developed and documented API (Swagger/OpenAPI), unit/integration tests (pytest), validation against a test database with pseudonymized records, and comprehensive documentation for coordinator stakeholders. Acceptance criteria: endpoint returns accurate, complete, and up-to-date aggregation; passes all tests; and meets coordinator data needs as validated in user acceptance testing.",
      "assignees": [
        { "display_name": "DZCLPT6" },
        { "display_name": "DZCHM26" }
      ],
      "skills": ""
    },
    {
      "subtask_id": "10003",
      "description": "**Subtask: Implement Backend API Endpoint for Aggregating Student Career Pathway Engagement Data**\n\nAs a career management coordinator with a background in pedagogy for secondary education, you need a reliable backend service that aggregates and exposes student career pathway engagement data in real-time to support targeted interventions and program tracking. This subtask involves designing and implementing a secure REST API endpoint in Python using Flask, with data models in PostgreSQL reflecting educational constructs like career pathways, skill milestones, and student progress logs. Data must be synchronized from the enterprise LMS (Moodle) and HRIS (SAP SuccessFactors) via scheduled ETL jobs, ensuring privacy and GDPR compliance throughout. You will develop efficient SQL queries for live aggregation (e.g., participation rates, skill attainment by cohort), and structure API responses for consumption by React dashboard components.\n\nTechnical requirements: Python (Flask), PostgreSQL (with SQLAlchemy ORM), REST API standards, OAuth 2.0 authentication, and integration logic for LMS/HRIS APIs. Required skills: Python backend development, relational data modeling, RESTful design, Docker-based containerization, and test-driven development (pytest). Domain expertise: pedagogical frameworks for career guidance, experience coordinating educational programs, and understanding of student data privacy regulations.\n\nDeliverables and acceptance criteria: (1) Documented, versioned API endpoint providing aggregated engagement data (Swagger/OpenAPI specs); (2) Unit and integration tests with mock LMS/HRIS data for accuracy and performance; (3) Secure API access with coordinator-level permissions; (4) Data model documentation mapping educational constructs to database schema; (5) Evidence of successful integration and UAT sign-off from coordinator stakeholders.",
      "assignees": [
        { "display_name": "DZCIH08" },
        { "display_name": "DZCPS1Z" }
      ],
      "skills": ""
    },
    {
      "subtask_id": "10004",
      "description": "**Subtask: Build the \"Student Skill Development Trend\" Visualization Component in the Career Management Analytics Dashboard**\n\nAs a career management coordinator in an educational setting, you will implement an interactive React component that visualizes longitudinal student skill development trends, segmented by career pathways and key competencies as defined by national education standards. This component must fetch aggregated student progress data from the backend (Flask REST API), using secure role-based endpoints, and display dynamic line and bar charts via Chart.js, supporting drill-downs by class, cohort, or individual student. Data should be structured in PostgreSQL with clear schema design to reflect students’ skill assessments and pathway progress, ensuring alignment with both pedagogical and career management frameworks. \n\nTechnical requirements: Proficiency in JavaScript/TypeScript and React (including hooks and context API), Chart.js for data visualization, RESTful API integration, Python (Flask) for backend endpoint consumption, and strong database querying with SQLAlchemy for PostgreSQL. Domain-specific skills include understanding secondary school skill framework mapping, progression tracking, and educational data privacy. \n\nDeliverables: (1) Fully responsive React charting component with user controls for filtering and exporting data, (2) secure and documented API requests, (3) coverage with Jest unit/integration tests, (4) code-level and UI documentation, and (5) validation of visualization accuracy against coordinator user stories and real data samples. Acceptance criteria: Component displays accurate, up-to-date student trends, passes all tests, and is verified through user acceptance testing with coordinator stakeholders for clarity, relevance, and actionable insights.",
      "assignees": [
        { "display_name": "DZCHM26" }
      ],
      "skills": ""
    },
    {
      "subtask_id": "10003",
      "description": "**Subtask: Implement “Training Participation Overview” Widget in Analytics Dashboard**\n\nTo provide career management coordinators with actionable insights, develop a “Training Participation Overview” widget as a reusable React component, visualizing real-time employee engagement in training initiatives (e.g., course enrollments, completion rates, and activity trends). The frontend component should utilize Chart.js for interactive graphs, while securely fetching aggregated data via a new REST API endpoint (`/api/analytics/training-participation/`) built with Django REST Framework. The backend should query the PostgreSQL database, joining HRIS and LMS-synced tables, and implement efficient caching (e.g., Redis) for performance. Integrate OAuth2-based corporate SSO to enforce role-based access, ensuring only authorized coordinators view relevant data. Required technical skills include proficiency in JavaScript/React, Python/Django, RESTful API development, SQL (PostgreSQL), and OAuth2 authentication; domain knowledge should include understanding of pedagogical approaches to staff development, interpretation of training metrics, and coordination best practices. Deliverables are: the React widget with responsive design, a documented Django API endpoint, updated data models as needed, comprehensive unit/integration tests, validated data accuracy, and clear user/technical documentation. Acceptance criteria: visually accurate participation trends, data refresh every hour, strict access controls, and positive user acceptance testing by coordinators.",
      "assignees": [
        { "display_name": "DZCHM26" },
        { "display_name": "DZCIS17" }
      ],
      "skills": ""
    },
    {
      "subtask_id": "10004",
      "description": "**Subtask: Implement Interactive Training Participation Visualization Component**\n\nAs a career management coordinator with a pedagogy background, you will develop an interactive React component that visualizes employee participation trends in training initiatives over time, enabling coordinators to identify patterns and gaps in staff development. This task requires creating a reusable React component (using Chart.js for data visualization) that fetches aggregated participation data from a Django REST API endpoint, with secure OAuth2 authentication and appropriate role-based data access. The backend must include a new RESTful endpoint (`/api/training/participation-stats/`) in Django, which executes optimized SQL queries on the PostgreSQL database to aggregate participation data by department, job role, and date, synchronizing relevant data via ETL from connected HRIS and LMS platforms. Required skills include advanced JavaScript/React (functional components, hooks, chart libraries), Python/Django REST Framework (API views, serializers), SQL/PostgreSQL (aggregation, indexing), and secure API integration. Domain knowledge in staff development, career progression, and pedagogical analysis is needed to ensure the metrics and filters align with coordinator needs and educational frameworks. Acceptance criteria: the component displays accurate, real-time visualizations with drill-down capability, is responsive and accessible, includes unit/integration tests, and provides user and technical documentation describing data sources, filter logic, and interpretation of results.",
      "assignees": [
        { "display_name": "DZCLPT6" },
        { "display_name": "DZCMF39" }
      ],
      "skills": ""
    },
    {
      "subtask_id": "10005",
      "description": "**Subtask: Implement Real-Time Training Participation Widget for Analytics Dashboard**\n\nAs a career management coordinator with a pedagogy background, you need a real-time visualization component showing employee participation in ongoing training initiatives, categorized by department and training type, to quickly identify engagement trends and target support. Implement a responsive React widget utilizing the Recharts library for data visualization, which fetches aggregated participation data from a custom Django REST API endpoint (`/api/training/participation/summary`). Backend processing in Django should query PostgreSQL tables updated by ETL jobs (pulling data from LMS and HRIS via REST APIs), aggregate participation counts per department/training, and expose the results in a paginated, secure API response. The React component should display interactive bar and pie charts, with filtering by date range and department, and handle live updates via WebSockets (Django Channels). Required skills: JavaScript/React (advanced), Recharts, Python/Django REST Framework, SQL/PostgreSQL, API design, WebSockets, and experience with LMS/HRIS data structures. Domain expertise in training program typologies, employee engagement, and pedagogical reporting is essential for designing meaningful aggregations and actionable visualizations. Deliverables: working React widget, secure and documented API endpoint, test data scripts, unit/integration tests, and a user guide for dashboard coordinators. Acceptance criteria: accurate real-time data, responsive UI/UX, comprehensive API documentation, and role-based access controls validated.",
      "assignees": [
        { "display_name": "DZCHM26" }
      ],
      "skills": ""
    },
    {
      "subtask_id": "10003",
      "description": "**Subtask: Implement Role-Based Dashboard Views for Educators, Coordinators, and Mentors**\n\nTo enable tailored access and interactions within the Career Management Coordination Dashboard, implement dynamic role-based dashboard views using React (with functional components and Hooks) and a Node.js/Express backend. The backend must expose a secure `/api/auth/me` endpoint that returns user profile and role information, using JWT for authentication and RBAC middleware for authorization. Frontend logic in React should conditionally render dashboard components (e.g., mentorship scheduling, student progress tracking, communication tools) based on the authenticated user's role (educator, coordinator, mentor).\n\nThis task requires proficiency in JavaScript/TypeScript, React, Node.js, Express, RESTful API design, and JWT-based authentication. It also demands understanding of educational workflows in secondary schools, teacher-coordinator collaboration models, and mentorship processes, reflecting Czech language curriculum and career guidance practices.\n\nDeliverables include: 1) Modular React components for each role with responsive UI, 2) Backend RBAC enforcement and user/role API, 3) Unit/integration tests (Jest), 4) User documentation for dashboard navigation, and 5) OpenAPI documentation for the role-related endpoints. Acceptance criteria: Users see only features relevant to their assigned role after login; unauthorized access is prevented; tests and documentation are complete; demo with sample educator, coordinator, and mentor accounts.",
      "assignees": [
        { "display_name": "US1PWZL" }
      ],
      "skills": ""
    },
    {
      "subtask_id": "10004",
      "description": "**Subtask: Implement Calendar Integration for Scheduling Student Mentorship Sessions**\n\nTo streamline the coordination of student career development activities, implement a calendar integration within the React-based dashboard that allows coordinators, teachers, and mentors to schedule and view student mentorship sessions. This involves creating a reusable React component that displays available time slots, syncs session bookings with Google Calendar using the Google Calendar API, and sends automated session reminders via SendGrid. The backend (Node.js/Express) should expose secure RESTful endpoints for creating, updating, and deleting mentorship events, persisting event data in PostgreSQL with appropriate relational mappings to student, mentor, and educator profiles. JWT authentication and RBAC must ensure only authorized users can view and manage relevant events.\n\nTechnical skills required include React (component state management, hooks), Node.js/Express (API design), PostgreSQL (schema modeling, SQL queries), and integration with OAuth2 for Google Calendar API. Familiarity with educational workflows (e.g., mentorship program scheduling, privacy of student data), GDPR compliance, and best practices in digital communication within schools is essential. Deliverables: A functioning calendar component with end-to-end integration, RESTful endpoints with unit and integration tests (Jest), and user documentation describing scheduling workflows for educators and coordinators. Acceptance criteria: Users can schedule, edit, and delete sessions; calendar sync and email reminders work reliably; all operations are access-controlled and documented.",
      "assignees": [
        { "display_name": "DZCIS17" },
        { "display_name": "DZCLPT6" }
      ],
      "skills": ""
    },
    {
      "subtask_id": "10005",
      "description": "**Subtask: Implement Role-Based Dashboard Views for Career Management Coordination Dashboard**\n\nImplement role-based dashboard views in the Career Management Coordination Dashboard, ensuring teachers, coordinators, and external mentors see tailored interfaces and access only the data and features relevant to their roles. Use React with functional components and Context API for front-end state management, and Node.js/Express to enforce RBAC logic in the RESTful API layer; JWT will be used to securely transmit role claims. PostgreSQL should store user roles and permissions, with tables normalized to reflect relationships between users, roles, and career development activities. The React app must conditionally render dashboard components (e.g., mentorship scheduling, student progress tracking, communication tools) based on authenticated user roles fetched from the backend. \n\nTechnical skills required: JavaScript/TypeScript, React, Node.js/Express, REST API architecture, PostgreSQL schema design, JWT authentication, Docker for development environment. Domain-specific expertise: understanding educational institution workflows, career guidance models for secondary schools, mentorship coordination, and privacy best practices per GDPR. \n\nDeliverables: End-to-end tested code (Jest/unit tests for UI and API); fully functional role-based dashboard views; documented workflows in user guide for educators/coordinators; OpenAPI/Swagger documentation for API endpoints. Acceptance: Dashboard shows correct features for each role with accurate permissions, tested with realistic sample users and actions; all access patterns comply with privacy requirements.",
      "assignees": [
        { "display_name": "DZCMF39" },
        { "display_name": "DZCHM26" }
      ],
      "skills": ""
    },
    {
      "subtask_id": "10004",
      "description": "**Subtask: Design and Implement the Career Development Workflow Builder UI in React**\n\nAs a career management coordinator supporting educators, I need a responsive, intuitive Workflow Builder interface within the DIGI platform that enables the creation, editing, and visualization of individualized career development plans for teachers and staff. This task involves designing and developing a React-based component suite (utilizing React Hooks, Redux for state management, and Material-UI for UI consistency) that allows coordinators to assemble workflow steps (e.g., training modules, milestone reviews, feedback requests) through a drag-and-drop interface. The frontend must consume RESTful endpoints (provided by the FastAPI backend), display real-time data from the PostgreSQL database, and initiate API calls to assign or update workflows. Integration points should include options to pull available training activities directly from the integrated Moodle LMS via REST API calls.\n\nRequired technical skills include React (with Hooks and Redux), REST API integration, asynchronous data handling (Axios or Fetch), and UI/UX best practices for workflow tools. Domain expertise in educational career development, pedagogy standards, and coordination processes is essential to ensure the tool aligns with teacher professional growth pathways and administrative workflows. Deliverables include a fully implemented and unit-tested Workflow Builder React module, comprehensive user documentation for coordinators and educators, seamless LMS integration capability, and accessibility compliance (WCAG 2.1 AA). Acceptance criteria: UI passes functional and usability testing, supports workflow creation/editing with role-based access (OAuth 2.0), integrates with backend/LMS, and is documented for end users.",
      "assignees": [
        { "display_name": "DZCHM26" }
      ],
      "skills": ""
    },
    {
      "subtask_id": "10005",
      "description": "**Subtask: Design and Implement the Career Development Workflow Builder UI Component**\n\nAs a career management coordinator specializing in teacher professional growth, I need a dedicated React-based workflow builder component within the DIGI platform to visually create, edit, and manage individualized career development plans for educators. The builder should allow coordinators to sequence career milestones, assign training activities (with LMS course lookups via REST API integration to Moodle), and set automated notification triggers for key events (sent via Celery). Implement using React functional components, Redux for state management, and Material-UI for UI consistency. On the backend, develop corresponding FastAPI endpoints to persist workflows and update educator profiles in PostgreSQL, ensuring role-based access via OAuth 2.0. Required skills include advanced React (hooks, Redux), RESTful API consumption, Python (FastAPI), SQL (PostgreSQL), and workflow modeling; domain expertise in educational career progression, teacher competencies, and coordination processes is essential. Deliverables: a fully interactive, responsive workflow builder UI; backend endpoints for saving/loading plans; integration with Moodle for training data; role-based access controls; comprehensive unit/integration tests; user documentation for coordinators and educators. Acceptance criteria: end-to-end tested workflow creation/editing, accurate LMS data sync, secure access, and clear user instructions.",
      "assignees": [
        { "display_name": "DZCPS1Z" }
      ],
      "skills": ""
    },
    {
      "subtask_id": "10006",
      "description": "**Subtask: Implement LMS Integration Service for Automated Training Data Synchronization**\n\nAs a career management coordinator supporting educators, I need an LMS integration service that automatically synchronizes training completion data from Moodle to our DIGI platform, enabling up-to-date tracking of teacher development milestones and supporting individualized career plans. This subtask involves building a backend microservice using Python (FastAPI) that authenticates with Moodle’s REST API, fetches relevant course completion records, and maps them to educator profiles in a secure PostgreSQL database. The integration must include robust error handling, logging, and support OAuth 2.0 for secure data exchange. You will create scheduled Celery tasks to fetch and update training statuses daily, ensuring that coordinators and educators have real-time visibility into progress. Required skills are Python, FastAPI, REST API integration, PostgreSQL, Celery, and Docker for service deployment; domain knowledge in teacher professional development, LMS data models, and education workflow coordination is essential. Deliverables: a thoroughly tested and documented LMS integration microservice, database migration scripts, configuration documentation, and an integration guide for coordinators, with acceptance criteria including successful data synchronization, error handling, and compliance with user access controls.",
      "assignees": [
        { "display_name": "US1PWZL" }
      ],
      "skills": ""
    }
  ]
}
