{"testovac": 3515, "reim": 2885, "id": 2073, "subtyp": 3288, "plat": 2539, "01": 2, "zp": 3741, "0001": 0, "1800": 8, "31": 10, "12": 6, "9999": 1029, "en": 1611, "special": 3142, "offers": 2401, "events": 1930, "goals": 2010, "organisational": 2440, "changes": 1266, "functionality": 2006, "internal": 2149, "signing": 3084, "authorisations": 1166, "structure": 3236, "job": 2180, "descriptions": 1515, "communication": 1312, "party": 2489, "institutions": 2134, "organisations": 2442, "90003266": 12, "time": 3533, "management": 2259, "90003272": 14, "trademark": 3588, "operations": 2417, "90003273": 16, "testovac reim": 3516, "reim var": 2886, "subtyp plat": 3289, "01 zp": 5, "0001 01": 1, "01 01": 3, "01 1800": 4, "1800 31": 9, "31 12": 11, "12 9999": 7, "9999 en": 1030, "en special": 1845, "special offers": 3146, "events 01": 1931, "en goals": 1722, "en organisational": 1776, "changes 01": 1267, "en functionality": 1721, "en internal": 1736, "signing authorisations": 3085, "authorisations 01": 1167, "structure 01": 3237, "descriptions 01": 1516, "en communication": 1652, "communication party": 1313, "party institutions": 2494, "institutions organisations": 2135, "organisations 01": 2443, "zp 90003266": 3742, "90003266 0001": 13, "en time": 1878, "time management": 3540, "management 01": 2260, "zp 90003272": 3743, "90003272 0001": 15, "en trademark": 1883, "trademark operations": 3592, "operations 01": 2418, "zp 90003273": 3744, "project": 2680, "team": 3398, "members": 2319, "90003276": 18, "employees": 1605, "90003278": 20, "instructions": 2138, "staff": 3163, "area": 1130, "concerned": 1352, "90003280": 22, "inter": 2147, "departmental": 1509, "activities": 1053, "tasks": 3367, "projects": 2701, "90003281": 24, "use": 3668, "90003289": 26, "arising": 1133, "meetings": 2315, "90003291": 28, "90003292": 30, "subordinate": 3279, "90003293": 32, "90003273 0001": 17, "en project": 1811, "project team": 2698, "team members": 3404, "members 01": 2320, "90003276 0001": 19, "employees 01": 1606, "90003278 0001": 21, "concerned 01": 1353, "90003280 0001": 23, "en inter": 1735, "tasks international": 3372, "projects 01": 2702, "90003281 0001": 25, "en use": 1887, "90003289 0001": 27, "en tasks": 1867, "tasks arising": 3369, "arising meetings": 1135, "meetings 01": 2316, "zp 90003291": 3745, "90003291 0001": 29, "en signing": 1839, "zp 90003292": 3746, "90003292 0001": 31, "en subordinate": 1858, "subordinate staff": 3280, "staff 01": 3164, "zp 90003293": 3747, "90003294": 34, "work": 3712, "90003295": 36, "operational": 2415, "technological": 3444, "compliance": 1331, "90003303": 38, "cooperation": 1402, "90003305": 40, "development": 1527, "partners": 2478, "90003307": 42, "collar": 1303, "90003308": 44, "delegated": 1496, "processes": 2628, "90003310": 46, "90003311": 48, "90003293 0001": 33, "tasks subordinate": 3374, "90003294 0001": 35, "en work": 1897, "90003295 0001": 37, "en operational": 1770, "technological compliance": 3445, "compliance 01": 1332, "90003303 0001": 39, "en cooperation": 1669, "cooperation party": 1407, "90003305 0001": 41, "partners 01": 2479, "90003307 0001": 43, "collar staff": 1304, "staff structure": 3172, "zp 90003308": 3748, "90003308 0001": 45, "en delegated": 1685, "delegated work": 1497, "work processes": 3717, "processes 01": 2629, "zp 90003310": 3749, "90003310 0001": 47, "tasks 01": 3368, "zp 90003311": 3750, "90003311 0001": 49, "90003321": 50, "employee": 1603, "working": 3722, "90003322": 52, "90003328": 54, "administrative": 1069, "agenda": 1086, "regard": 2858, "confidential": 1357, "90003329": 56, "book": 1198, "inventory": 2158, "checks": 1277, "90003330": 58, "90003333": 60, "meeting": 2311, "90003334": 62, "regarding": 2863, "assessments": 1143, "90003335": 64, "tasks project": 3373, "90003321 0001": 51, "en employee": 1705, "time 01": 3534, "90003322 0001": 53, "90003328 0001": 55, "en administrative": 1617, "regard confidential": 2859, "90003329 0001": 57, "administrative work": 1070, "checks 01": 1278, "90003330 0001": 59, "work 01": 3713, "zp 90003333": 3751, "90003333 0001": 61, "en meeting": 1758, "meeting agenda": 2313, "agenda 01": 1087, "zp 90003334": 3752, "90003334 0001": 63, "en agenda": 1623, "agenda regarding": 1088, "regarding instructions": 2869, "instructions assessments": 2140, "assessments 01": 1144, "zp 90003335": 3753, "90003335 0001": 65, "reports": 2947, "task": 3365, "check": 1274, "90003336": 66, "relevant": 2910, "approvals": 1127, "proposals": 2716, "board": 1188, "including": 2101, "protocols": 2731, "90003338": 68, "info": 2105, "updates": 3662, "90003339": 70, "90003342": 72, "result": 2993, "analyses": 1096, "statistics": 3190, "90003345": 74, "assistant": 1153, "member": 2317, "90003346": 76, "packing": 2466, "identification": 2077, "90003347": 78, "foreign": 1995, "lang": 2195, "reports task": 2951, "task complet": 3366, "90003336 0001": 67, "en activities": 1614, "activities relevant": 1057, "relevant approvals": 2911, "proposals board": 2718, "protocols 01": 2732, "90003338 0001": 69, "updates 01": 3663, "90003339 0001": 71, "90003342 0001": 73, "result analyses": 2994, "analyses statistics": 1099, "statistics 01": 3191, "90003345 0001": 75, "en assistant": 1633, "assistant tasks": 1154, "tasks board": 3370, "board member": 1192, "member 01": 2318, "zp 90003346": 3754, "90003346 0001": 77, "en book": 1639, "book packing": 1200, "packing identification": 2467, "identification 01": 2078, "zp 90003347": 3755, "90003347 0001": 79, "en foreign": 1719, "foreign lang": 1997, "correspondence": 1420, "90003350": 80, "supervisory": 3304, "group": 2022, "expert": 1944, "teams": 3408, "head": 2042, "90003352": 82, "deliveries": 1498, "office": 2402, "supplies": 3316, "gifts": 2008, "promotional": 2711, "90003353": 84, "attendance": 1155, "overviews": 2459, "90003356": 86, "excursions": 1938, "90003359": 88, "secretariat": 3044, "operation": 2407, "90003361": 90, "portal": 2547, "correspondence 01": 1421, "90003350 0001": 81, "supervisory board": 3305, "board group": 1191, "group expert": 2023, "expert teams": 1946, "teams head": 3410, "90003352 0001": 83, "en deliveries": 1686, "office supplies": 2403, "supplies gifts": 3318, "gifts promotional": 2009, "promotional objects": 2715, "90003353 0001": 85, "en staff": 1849, "staff attendance": 3165, "time overviews": 3541, "overviews 01": 2460, "zp 90003356": 3756, "90003356 0001": 87, "en excursions": 1712, "excursions 01": 1939, "zp 90003359": 3757, "90003359 0001": 89, "en secretariat": 1834, "secretariat operation": 3045, "operation 01": 2408, "zp 90003361": 3758, "90003361 0001": 91, "en info": 1730, "info employee": 2107, "employee portal": 1604, "portal 01": 2548, "exter": 1953, "ups": 3666, "students": 3256, "90003367": 92, "refreshments": 2856, "risk": 3007, "reduct": 2845, "measures": 2299, "90003372": 94, "organisation": 2439, "90003374": 96, "student": 3242, "hr": 2051, "90003375": 98, "data": 1462, "90003377": 100, "payments": 2502, "90003378": 102, "inter exter": 2148, "check ups": 1276, "students 01": 3257, "refreshments meetings": 2857, "90003371 0001": 93, "en risk": 1830, "reduct elimin": 2846, "measures 01": 2300, "90003372 0001": 95, "90003374 0001": 97, "en student": 1854, "student hr": 3249, "hr agenda": 2052, "zp 90003375": 3759, "90003375 0001": 99, "staff hr": 3166, "hr data": 2054, "data 01": 1463, "zp 90003377": 3760, "90003377 0001": 101, "en payments": 1780, "payments party": 2504, "party staff": 2495, "zp 90003378": 3761, "responsibilities": 2981, "divisions": 1563, "sub": 3277, "inputs": 2118, "studies": 3268, "related": 2889, "presentations": 2583, "90003385": 104, "involving": 2172, "familiarity": 1967, "wide": 3710, "contexts": 1384, "90003387": 106, "investment": 2160, "90003378 0001": 103, "en responsibilities": 1828, "responsibilities arising": 2983, "sub projects": 3278, "en inputs": 1734, "inputs 01": 2119, "en studies": 1856, "studies related": 3270, "related inputs": 2892, "analyses 01": 1097, "presentations 01": 2584, "zp 90003385": 3762, "90003385 0001": 105, "en confidential": 1661, "confidential inputs": 1358, "inputs responsibilities": 2127, "responsibilities involving": 2985, "involving familiarity": 2173, "familiarity internal": 1968, "internal group": 2151, "group wide": 2027, "wide contexts": 3711, "contexts 01": 1385, "zp 90003387": 3763, "90003387 0001": 107, "inputs investment": 2124, "bwa": 1222, "90003389": 108, "90003390": 110, "status": 3193, "agendas": 1091, "items": 2176, "production": 2644, "logistics": 2235, "90003391": 112, "departments": 1510, "pre": 2564, "interviews": 2156, "90003396": 114, "90003398": 116, "recruitment": 2837, "90003400": 118, "90003389 0001": 109, "inputs meetings": 2125, "90003390 0001": 111, "regarding status": 2871, "status agendas": 3195, "team production": 3405, "90003391 0001": 113, "en departments": 1689, "pre interviews": 2566, "interviews meetings": 2157, "90003396 0001": 115, "board 01": 1189, "zp 90003398": 3764, "90003398 0001": 117, "student recruitment": 3253, "recruitment inputs": 2839, "zp 90003400": 3765, "90003400 0001": 119, "inputs board": 2120, "board expert": 1190, "expert team": 1945, "team meetings": 3403, "90003402": 120, "90003404": 122, "cost": 1422, "reduction": 2847, "potential": 2555, "90003405": 124, "school": 3029, "90003408": 126, "fitting": 1984, "90003409": 128, "certif": 1258, "mfa": 2339, "cards": 1240, "90003412": 130, "90003413": 132, "presentation": 2579, "materials": 2286, "external": 1955, "90003417": 134, "90003402 0001": 121, "teams 01": 3409, "90003404 0001": 123, "cost reduction": 1427, "reduction potential": 2848, "90003405 0001": 125, "90003408 0001": 127, "en fitting": 1718, "90003409 0001": 129, "student status": 3254, "status certif": 3197, "certif mfa": 1259, "mfa cards": 2340, "cards 01": 1241, "zp 90003412": 3766, "90003412 0001": 131, "en presentations": 1796, "zp 90003413": 3767, "90003413 0001": 133, "en presentation": 1795, "presentation materials": 2582, "materials internal": 2287, "internal external": 2150, "external use": 1956, "use 01": 3669, "zp 90003417": 3768, "90003417 0001": 135, "90003419": 136, "providing": 2742, "sou": 3129, "90003426": 138, "90003436": 140, "prep": 2570, "final": 1973, "exams": 1934, "90003437": 142, "90003438": 144, "lending": 2213, "90003440": 146, "implementation": 2084, "ht": 2065, "90003442": 148, "completion": 1328, "deadlines": 1476, "en board": 1638, "90003419 0001": 137, "en providing": 1815, "providing info": 2743, "sou students": 3134, "students par": 3263, "90003426 0001": 139, "en students": 1855, "students starting": 3266, "90003436 0001": 141, "en prep": 1793, "final exams": 1975, "exams 01": 1935, "90003437 0001": 143, "relevant hr": 2913, "90003438 0001": 145, "book lending": 1199, "lending 01": 2214, "zp 90003440": 3769, "90003440 0001": 147, "en implementation": 1728, "implementation ht": 2086, "ht measures": 2066, "zp 90003442": 3770, "90003442 0001": 149, "en completion": 1654, "completion tasks": 1330, "tasks deadlines": 3371, "deadlines 01": 1477, "advertising": 1080, "press": 2586, "media": 2307, "document": 1567, "shredding": 3080, "statistical": 3187, "90003460": 150, "condition": 1354, "aid": 1094, "kits": 2181, "90003466": 152, "dates": 1473, "en advertising": 1621, "en document": 1698, "shredding 01": 3081, "en statistical": 1850, "statistical inputs": 3188, "zp 90003460": 3771, "90003460 0001": 151, "en condition": 1659, "condition school": 1355, "school aid": 3030, "aid kits": 1095, "kits 01": 2182, "zp 90003466": 3772, "90003466 0001": 153, "en dates": 1682, "dates project": 1475, "project presentations": 2694, "sorting": 3124, "shelving": 3076, "received": 2822, "prod": 2633, "templates": 3468, "producing": 2637, "level": 2217, "90003474": 154, "exp": 1942, "meet": 2309, "90003477": 156, "accommodation": 1038, "food": 1993, "guests": 2034, "visitors": 3700, "sorting shelving": 3128, "en sorting": 1843, "sorting hr": 3125, "received mail": 2823, "en prod": 1805, "templates 01": 3469, "en producing": 1806, "team level": 3401, "level meetings": 2220, "zp 90003474": 3773, "90003474 0001": 155, "prod inputs": 2634, "inputs exp": 2122, "exp meet": 1943, "meet 01": 2310, "zp 90003477": 3774, "90003477 0001": 157, "en accommodation": 1613, "accommodation food": 1039, "food guests": 1994, "guests visitors": 2035, "visitors 01": 3701, "credit": 1443, "card": 1238, "statements": 3184, "designing": 1523, "programmes": 2674, "vips": 3696, "utilisation": 3681, "quality": 2769, "minutes": 2342, "90003494": 158, "test": 3488, "90003497": 160, "business": 1219, "plan": 2523, "accomplish": 1040, "90003504": 162, "statements 01": 3185, "en designing": 1691, "vips 01": 3697, "utilisation 01": 3682, "providing inputs": 2744, "quality management": 2776, "en minutes": 1761, "minutes meetings": 2343, "zp 90003494": 3775, "90003494 0001": 159, "en test": 1875, "test reports": 3501, "reports 01": 2948, "zp 90003497": 3776, "90003497 0001": 161, "en business": 1643, "business plan": 1220, "plan accomplish": 2525, "accomplish reports": 1041, "zp 90003504": 3777, "90003504 0001": 163, "change": 1262, "order": 2431, "reflecting": 2854, "mgmt": 2341, "systems": 3333, "tech": 3411, "preparation": 2571, "orders": 2435, "technical": 3416, "documents": 1573, "90003573": 164, "occurrence": 2399, "quantity": 2788, "deviations": 1536, "releases": 2900, "90003579": 166, "procedure": 2611, "launch": 2200, "en change": 1648, "reflecting changes": 2855, "systems 01": 3334, "en tech": 1870, "tech prod": 3415, "preparation 01": 2572, "change orders": 1263, "changes technical": 1271, "technical documents": 3425, "documents 01": 1574, "en technical": 1871, "technical changes": 3420, "zp 90003573": 3778, "90003573 0001": 165, "en occurrence": 1767, "occurrence quantity": 2400, "quantity deviations": 2790, "deviations releases": 1538, "releases 01": 2901, "zp 90003579": 3779, "90003579 0001": 167, "change procedure": 1264, "procedure launch": 2613, "market": 2268, "analysis": 1100, "benchmark": 1181, "best": 1186, "benchmarking": 1183, "export": 1949, "markets": 2275, "90003598": 168, "90003619": 170, "trends": 3644, "90003621": 172, "concepts": 1349, "orders 01": 2436, "en market": 1752, "market analysis": 2269, "benchmark 01": 1182, "en hr": 1727, "hr processes": 2059, "processes benchmark": 2630, "inputs export": 2123, "export markets": 1950, "markets 01": 2276, "zp 90003598": 3780, "90003598 0001": 169, "plan 01": 2524, "zp 90003619": 3781, "90003619 0001": 171, "hr trends": 2064, "trends 01": 3645, "zp 90003621": 3782, "90003621 0001": 173, "en concepts": 1658, "elements": 1599, "solution": 3116, "concept": 1345, "based": 1175, "suggestions": 3294, "information": 2108, "motivational": 2361, "campaigns": 1229, "90003681": 174, "research": 2966, "90003684": 176, "preparations": 2574, "90003730": 178, "drafting": 1583, "project concepts": 2683, "concepts 01": 1350, "solution concept": 3118, "concept 01": 1346, "suggestions 01": 3295, "en promotional": 1813, "promotional information": 2713, "motivational campaigns": 2362, "campaigns events": 1230, "zp 90003681": 3783, "90003681 0001": 175, "market research": 2271, "research 01": 2967, "zp 90003684": 3784, "90003684 0001": 177, "meeting preparations": 2314, "preparations 01": 2575, "zp 90003730": 3785, "90003730 0001": 179, "plan drafting": 2526, "competitor": 1321, "brands": 1201, "strategy": 3229, "product": 2639, "requirements": 2959, "90003757": 180, "90003762": 182, "critical": 1444, "factors": 1959, "90003782": 184, "relevant brands": 2912, "strategy 01": 3230, "project goals": 2688, "goals 01": 2011, "en product": 1807, "development 01": 1528, "projects including": 2707, "change requirements": 1265, "requirements 01": 2960, "project related": 2695, "related analyses": 2890, "90003757 0001": 181, "hr projects": 2060, "zp 90003762": 3786, "90003762 0001": 183, "en critical": 1675, "critical project": 1448, "project factors": 2687, "factors 01": 1960, "zp 90003782": 3787, "90003782 0001": 185, "en quality": 1818, "quality requirements": 2783, "requirements project": 2964, "project launch": 2690, "model": 2346, "care": 1242, "progress": 2678, "terms": 3480, "content": 1377, "costs": 1429, "90003808": 186, "90003828": 188, "strategic": 3224, "90003830": 190, "assigned": 1147, "project status": 2697, "status reports": 3201, "project teams": 2699, "en projects": 1812, "en model": 1762, "care projects": 1244, "projects facelifts": 2706, "project implementation": 2689, "progress terms": 2679, "terms content": 3482, "content costs": 1379, "costs quality": 1432, "quality deadlines": 2773, "90003808 0001": 187, "status info": 3198, "info 01": 2106, "zp 90003828": 3788, "90003828 0001": 189, "en strategic": 1852, "strategic hr": 3225, "hr care": 2053, "zp 90003830": 3789, "90003830 0001": 191, "projects assigned": 2703, "assigned 01": 1148, "schedules": 3025, "potentials": 2557, "brief": 1204, "new": 2377, "launches": 2202, "90003865": 192, "line": 2227, "90003867": 194, "90003874": 196, "project schedules": 2696, "schedules 01": 3026, "en development": 1693, "reduction potentials": 2849, "potentials 01": 2558, "project brief": 2682, "quality mgmt": 2777, "new production": 2383, "production launches": 2651, "launches 01": 2203, "zp 90003865": 3790, "90003865 0001": 193, "model line": 2349, "line launches": 2228, "zp 90003867": 3791, "90003867 0001": 195, "en new": 1765, "new launches": 2379, "zp 90003874": 3792, "90003874 0001": 197, "vehicle": 3685, "series": 3056, "problems": 2605, "suppliers": 3311, "reduce": 2842, "audit": 1157, "identified": 2079, "deficiencies": 1490, "90003934": 198, "90003935": 200, "simulation": 3088, "new vehicle": 2388, "new projects": 2384, "projects series": 2709, "series production": 3057, "production 01": 2645, "problems 01": 2606, "quality releases": 2782, "releases based": 2903, "suppliers day": 3313, "en measures": 1756, "measures reduce": 2304, "reduce quality": 2844, "quality audit": 2771, "audit identified": 1161, "identified deficiencies": 2080, "deficiencies production": 1491, "zp 90003934": 3793, "90003934 0001": 199, "production launch": 2650, "launch preparation": 2201, "zp 90003935": 3794, "90003935 0001": 201, "en production": 1808, "production simulation": 2656, "simulation studies": 3092, "vehicles": 3690, "customers": 1455, "engineering": 1906, "design": 1517, "documentation": 1570, "virtual": 3698, "reality": 2818, "measurement": 2295, "report": 2941, "specifications": 3153, "90004054": 202, "study": 3271, "construction": 1363, "90004065": 204, "studies 01": 3269, "en documents": 1700, "vehicles employees": 3692, "employees customers": 1607, "en engineering": 1708, "engineering design": 1907, "documentation 01": 1571, "virtual reality": 3699, "reality presentations": 2820, "project documentation": 2686, "en measurement": 1755, "report 01": 2942, "en specifications": 1846, "specifications technical": 3155, "technical logistics": 3431, "logistics quality": 2238, "quality 01": 2770, "zp 90004054": 3795, "90004054 0001": 203, "production study": 2657, "study construction": 3273, "construction project": 1364, "project plan": 2692, "zp 90004065": 3796, "90004065 0001": 205, "technical technological": 3440, "technological documentation": 3446, "pod": 2540, "90004129": 206, "procedural": 2609, "90004130": 208, "90004132": 210, "technical documentation": 3424, "en technological": 1872, "tech documentation": 3412, "en changes": 1649, "en pod": 1788, "zp 90004129": 3797, "90004129 0001": 207, "en compliance": 1655, "compliance procedural": 1334, "procedural organisational": 2610, "organisational documentation": 2441, "zp 90004130": 3798, "90004130 0001": 209, "en documentation": 1699, "zp 90004132": 3799, "90004132 0001": 211, "professional": 2669, "archiving": 1128, "90004153": 212, "storage": 3218, "90004163": 214, "rules": 3016, "90004168": 216, "relevant pod": 2914, "en professional": 1809, "document archiving": 1568, "zp 90004153": 3800, "90004153 0001": 213, "archiving storage": 1129, "storage 01": 3219, "zp 90004163": 3801, "90004163 0001": 215, "documents document": 1575, "document management": 1569, "management rules": 2264, "rules 01": 3017, "zp 90004168": 3802, "90004168 0001": 217, "material": 2277, "methods": 2331, "solutions": 3119, "models": 2352, "process": 2620, "measurements": 2297, "modelling": 2350, "90004261": 218, "optimisation": 2421, "90004262": 220, "90004264": 222, "material 01": 2278, "new methods": 2380, "reality solutions": 2821, "solutions 01": 3120, "models 01": 2353, "en logistics": 1748, "work process": 3716, "measurements 01": 2298, "process modelling": 2624, "modelling 01": 2351, "zp 90004261": 3803, "90004261 0001": 219, "en optimisation": 1772, "optimisation technological": 2426, "technological methods": 3450, "methods 01": 2332, "zp 90004262": 3804, "90004262 0001": 221, "optimisation measures": 2424, "zp 90004264": 3805, "90004264 0001": 223, "kvp": 2188, "ws": 3736, "employment": 1610, "objective": 2394, "optimise": 2427, "ergonomics": 1923, "intensiveness": 2143, "90004298": 224, "bonuses": 1195, "benefits": 1184, "workshop": 3728, "reductions": 2850, "en kvp": 1743, "kvp ws": 2189, "en employment": 1706, "systems production": 3336, "production methods": 2652, "costs 01": 1430, "measures optimise": 2303, "optimise ergonomics": 2428, "ergonomics work": 1924, "work intensiveness": 3715, "intensiveness 01": 2144, "zp 90004298": 3806, "90004298 0001": 225, "inputs payments": 2126, "payments bonuses": 2503, "bonuses benefits": 1197, "benefits arising": 1185, "arising workshop": 1137, "workshop based": 3729, "based cost": 1176, "cost reductions": 1428, "reductions 01": 2851, "training": 3612, "equipment": 1916, "rationalisation": 2814, "tool": 3549, "implementing": 2090, "90004314": 226, "90004315": 228, "90004316": 230, "training atc": 3615, "tech equipment": 3413, "equipment 01": 1917, "rationalisation measures": 2815, "tool production": 3556, "production implementation": 2649, "implementation kvp": 2087, "team based": 3400, "implementing cost": 2092, "zp 90004314": 3807, "90004314 0001": 227, "en proposals": 1814, "proposals team": 2721, "team team": 3407, "team 01": 3399, "zp 90004315": 3808, "90004315 0001": 229, "project content": 2684, "costs schedules": 1434, "zp 90004316": 3809, "90004316 0001": 231, "supplier": 3308, "context": 1383, "taken": 3341, "mitigate": 2344, "90004342": 232, "zebra": 3739, "90004348": 234, "90004366": 236, "process optimisation": 2626, "optimisation 01": 2422, "proposals regarding": 2720, "regarding supplier": 2872, "supplier context": 3309, "en analyses": 1624, "analyses quality": 1098, "quality problems": 2780, "taken mitigate": 3343, "mitigate problems": 2345, "zp 90004342": 3810, "90004342 0001": 233, "en zebra": 1900, "zebra proposals": 3740, "proposals 01": 2717, "zp 90004348": 3811, "90004348 0001": 235, "optimisation proposals": 2425, "zp 90004366": 3812, "90004366 0001": 237, "relevance": 2908, "technologies": 3456, "planning": 2532, "targets": 3362, "capacity": 1231, "assembly": 1140, "takting": 3356, "workflows": 3720, "90004386": 238, "90004392": 240, "relevance preparedness": 2909, "production technologies": 2658, "technologies 01": 3457, "production planning": 2653, "planning targets": 2534, "targets 01": 3363, "production process": 2654, "process simulation": 2627, "simulation projects": 3091, "relevant production": 2915, "production capacity": 2646, "takting 01": 3357, "compliance production": 1335, "production workflows": 2662, "workflows documentation": 3721, "zp 90004386": 3813, "90004386 0001": 239, "zp 90004392": 3814, "90004392 0001": 241, "implementation new": 2088, "methods trends": 2335, "trends production": 3649, "range": 2802, "application": 1112, "technology": 3460, "90004414": 242, "dm": 1565, "reconstruction": 2829, "modernisation": 2354, "90004416": 244, "semi": 3054, "finished": 1980, "products": 2665, "components": 1339, "en quantity": 1820, "quantity product": 2791, "range deadlines": 2803, "en application": 1627, "technical deviations": 3423, "technology compliance": 3462, "en material": 1754, "zp 90004414": 3815, "90004414 0001": 243, "en dm": 1697, "dm reconstruction": 1566, "reconstruction modernisation": 2830, "modernisation plan": 2355, "zp 90004416": 3816, "90004416 0001": 245, "en plan": 1786, "plan production": 2528, "production semi": 2655, "semi finished": 3055, "finished products": 1981, "products components": 2667, "components training": 1342, "training 01": 3613, "workplace": 3724, "overview": 2458, "machinery": 2243, "repairs": 2929, "reconstructions": 2831, "parts": 2480, "pressing": 2587, "simulations": 3093, "90004448": 246, "90004450": 248, "times": 3543, "required": 2954, "mtm": 2363, "frame": 2000, "90004454": 250, "project planning": 2693, "activities 01": 1054, "en workplace": 1898, "production time": 2660, "time changes": 3535, "technological equipment": 3449, "repairs reconstructions": 2938, "reconstructions parts": 2832, "parts 01": 2481, "simulations 01": 3094, "zp 90004448": 3817, "90004448 0001": 247, "simulation model": 3090, "model 01": 2347, "zp 90004450": 3818, "90004450 0001": 249, "en times": 1879, "times required": 3544, "required mtm": 2956, "mtm analysis": 2364, "analysis staff": 1103, "staff time": 3173, "time frame": 3539, "frame 01": 2001, "zp 90004454": 3819, "90004454 0001": 251, "briefs": 1205, "risks": 3008, "productive": 2663, "90004477": 252, "tooling": 3561, "90004480": 254, "90004484": 256, "topics": 3573, "practical": 2559, "technical briefs": 3419, "technical engineering": 3426, "technological risks": 3453, "technological production": 3452, "technological engineering": 3448, "solutions productive": 3122, "zp 90004477": 3820, "90004477 0001": 253, "en tooling": 1881, "tooling technology": 3564, "technology 01": 3461, "zp 90004480": 3821, "90004480 0001": 255, "en machinery": 1749, "machinery technology": 2250, "zp 90004484": 3822, "90004484 0001": 257, "en topics": 1882, "topics practical": 3575, "practical parts": 2562, "schedule": 3023, "performed": 2515, "dispatch": 1555, "long": 2239, "term": 3475, "strategies": 3226, "input": 2116, "90004503": 258, "calculations": 1227, "90004509": 260, "responsibility": 2987, "productive work": 2664, "en technology": 1873, "technology development": 3463, "development trends": 1535, "long term": 2240, "term strategies": 3478, "strategies digital": 3227, "en vehicles": 1893, "requirements knocked": 2962, "vehicle analyses": 3686, "en input": 1733, "input data": 2117, "data simulations": 1470, "zp 90004503": 3823, "90004503 0001": 259, "capacity calculations": 1232, "calculations 01": 1228, "zp 90004509": 3824, "90004509 0001": 261, "en briefs": 1640, "briefs projects": 1206, "projects responsibility": 2708, "classification": 1292, "according": 1044, "standard": 3178, "catalogue": 1252, "consumption": 1371, "90004532": 262, "operator": 2419, "90004540": 264, "outcomes": 2451, "90004541": 266, "warehousing": 3707, "responsibility indiv": 2988, "departments 01": 1511, "en responsibility": 1829, "responsibility material": 2990, "practical training": 2563, "technological operations": 3451, "catalogue 01": 1253, "new technologies": 2385, "time consumption": 3537, "staff standard": 3170, "standard 01": 3179, "zp 90004532": 3825, "90004532 0001": 263, "en operator": 1771, "operator staff": 2420, "zp 90004540": 3826, "90004540 0001": 265, "en workshop": 1899, "workshop outcomes": 3730, "outcomes 01": 2452, "zp 90004541": 3827, "90004541 0001": 267, "en tool": 1880, "tool warehousing": 3560, "maintenance": 2252, "tools": 3565, "devices": 1539, "suitable": 3298, "tightening": 3531, "torque": 3576, "90004550": 268, "replacement": 2939, "90004551": 270, "renovation": 2922, "responsibilities 01": 2982, "en parts": 1778, "tools measurement": 3569, "measurement devices": 2296, "devices 01": 1540, "suitable tools": 3300, "tools regard": 3570, "regard tightening": 2862, "tightening torque": 3532, "torque compliance": 3577, "tool repairs": 3558, "repairs 01": 2930, "new tools": 2386, "tools 01": 3566, "zp 90004550": 3828, "90004550 0001": 269, "tool replacement": 3559, "replacement modernisation": 2940, "modernisation requirements": 2356, "zp 90004551": 3829, "90004551 0001": 271, "tool maintenance": 3554, "maintenance renovation": 2257, "renovation consumption": 2923, "consumption process": 1376, "process objective": 2625, "repair": 2925, "annual": 1107, "plans": 2535, "protective": 2729, "takeover": 3344, "provision": 2747, "distribution": 1560, "points": 2541, "budget": 1209, "90004579": 272, "90004582": 274, "inspections": 2130, "tool repair": 3557, "repair report": 2928, "en annual": 1625, "required tools": 2957, "protective equipment": 2730, "tool check": 3551, "takeover 01": 3345, "tool lending": 3553, "provision distribution": 2748, "points 01": 2542, "en equipment": 1710, "equipment maintenance": 1921, "maintenance budget": 2254, "budget 01": 1210, "zp 90004579": 3830, "90004579 0001": 273, "equipment management": 1922, "management operation": 2263, "operation maintenance": 2411, "maintenance 01": 2253, "zp 90004582": 3831, "90004582 0001": 275, "en maintenance": 1750, "maintenance inspections": 2256, "inspections machinery": 2132, "machinery tools": 2251, "tools vehicles": 3572, "defects": 1487, "failures": 1965, "breakdowns": 1202, "provided": 2733, "assets": 1145, "user": 3677, "takeovers": 3347, "buildings": 1214, "structures": 3239, "elimination": 1601, "90004635": 276, "90004636": 278, "90004637": 280, "vehicles 01": 3691, "defects failures": 1489, "failures breakdowns": 1966, "provided entrusted": 2735, "repair methods": 2926, "en user": 1889, "takeovers buildings": 3349, "buildings structures": 1216, "structures 01": 3240, "en elimination": 1704, "elimination machinery": 1602, "machinery defects": 2245, "defects 01": 1488, "zp 90004635": 3832, "90004635 0001": 277, "machinery repairs": 2248, "repairs inspections": 2935, "inspections 01": 2131, "zp 90004636": 3833, "90004636 0001": 279, "en repairs": 1825, "repairs machinery": 2936, "machinery 01": 2244, "zp 90004637": 3834, "90004637 0001": 281, "preventative": 2589, "technol": 3442, "specification": 3151, "purchases": 2756, "spare": 3139, "90004655": 282, "diagnostics": 1541, "responsibiliies": 2979, "90004656": 284, "disposal": 1557, "unused": 3660, "unneeded": 3656, "en preventative": 1798, "technol equipment": 3443, "specification purchases": 3152, "purchases spare": 2758, "spare parts": 3140, "technical condition": 3421, "zp 90004655": 3835, "90004655 0001": 283, "machinery diagnostics": 2246, "diagnostics responsibiliies": 1542, "responsibiliies 01": 2980, "zp 90004656": 3836, "90004656 0001": 285, "sorting preparation": 3126, "preparation storage": 2573, "storage disposal": 3220, "disposal unused": 1559, "unused unneeded": 3661, "unneeded machinery": 3657, "hand": 2038, "overs": 2457, "tests": 3517, "energy": 1901, "90004671": 286, "90004672": 288, "sites": 3099, "en hand": 1724, "hand overs": 2039, "breakdowns 01": 1203, "tests 01": 3518, "energy equipment": 1903, "repair renovation": 2927, "renovation costs": 2924, "machinery failures": 2247, "zp 90004671": 3837, "90004671 0001": 287, "preventative measures": 2591, "zp 90004672": 3838, "90004672 0001": 289, "en takeovers": 1866, "takeovers machinery": 3351, "machinery technological": 2249, "equipment construction": 1919, "construction sites": 1365, "permanent": 2517, "services": 3067, "problematic": 2603, "type": 3651, "control": 1399, "90004686": 290, "basic": 1179, "simul": 3086, "90004687": 292, "sites permanent": 3102, "permanent use": 2518, "takeovers delivered": 3350, "products 01": 2666, "takeovers tools": 3353, "tools test": 3571, "test permanent": 3497, "tech inspections": 3414, "en problematic": 1801, "quantity spare": 2792, "repairs control": 2932, "control systems": 1401, "systems technological": 3340, "technological systems": 3455, "zp 90004686": 3839, "90004686 0001": 291, "new basic": 2378, "basic components": 1180, "components simul": 1341, "simul 01": 3087, "zp 90004687": 3840, "90004687 0001": 293, "en control": 1668, "sw": 3323, "hw": 2069, "electronic": 1597, "downtimes": 1578, "90004691": 294, "90004693": 296, "90004694": 298, "staff parties": 3167, "sw hw": 3326, "repairs maintenance": 2937, "zp 90004691": 3841, "90004691 0001": 295, "preventative check": 2590, "ups control": 3667, "zp 90004693": 3842, "90004693 0001": 297, "systems programmes": 3337, "programmes 01": 2675, "zp 90004694": 3843, "90004694 0001": 299, "configurations": 1359, "90004716": 300, "consumables": 1369, "90004720": 302, "networks": 2376, "sw 01": 3324, "repairs application": 2931, "hw sw": 2070, "sw control": 3325, "zp 90004716": 3844, "90004716 0001": 301, "en consumption": 1663, "consumption energy": 1373, "energy consumables": 1902, "consumables materials": 1370, "materials office": 2288, "supplies 01": 3317, "zp 90004720": 3845, "90004720 0001": 303, "maintenance repairs": 2258, "repairs energy": 2933, "equipment distribution": 1920, "distribution networks": 1562, "adaptation": 1061, "produced": 2635, "volumes": 3702, "scheduling": 3027, "90004823": 304, "event": 1927, "unprovided": 3658, "90004833": 306, "tool adaptation": 3550, "spare requirements": 3141, "en vehicle": 1892, "vehicle production": 3689, "en capacity": 1647, "capacity operational": 1233, "operational planning": 2416, "planning scheduling": 2533, "scheduling 01": 3028, "zp 90004823": 3846, "90004823 0001": 305, "special process": 3147, "process event": 2623, "event unprovided": 1929, "unprovided production": 3659, "zp 90004833": 3847, "90004833 0001": 307, "operating": 2406, "contracts": 1396, "performance": 2511, "flow": 1985, "outlooks": 2455, "defined": 1492, "ranges": 2804, "90004910": 308, "90004914": 310, "en pre": 1792, "pre series": 2567, "flow 01": 1986, "consumption outlooks": 1375, "outlooks overviews": 2456, "overviews defined": 2461, "defined product": 1493, "product ranges": 2643, "ranges 01": 2805, "zp 90004910": 3848, "90004910 0001": 309, "critical logistics": 1446, "logistics flow": 2237, "flow control": 1987, "control points": 1400, "zp 90004914": 3849, "90004914 0001": 311, "accomplishment": 1042, "packaging": 2464, "loading": 2231, "local": 2232, "purchased": 2754, "complaint": 1324, "complaints": 1326, "defect": 1482, "claims": 1285, "90004971": 312, "labour": 2192, "90004985": 314, "claim": 1281, "90005001": 316, "damage": 1460, "scrap": 3038, "targets accomplishment": 3364, "accomplishment 01": 1043, "en management": 1751, "purchased parts": 2755, "en complaint": 1653, "defect claims": 1484, "complaints 01": 1327, "zp 90004971": 3850, "90004971 0001": 313, "en labour": 1745, "labour time": 2194, "time complaints": 3536, "zp 90004985": 3851, "90004985 0001": 315, "complaint defect": 1325, "defect claim": 1483, "claim procedure": 1282, "procedure 01": 2612, "zp 90005001": 3852, "90005001 0001": 317, "en damage": 1680, "damage scrap": 1461, "scrap reports": 3039, "rightfulness": 3005, "stock": 3204, "rate": 2806, "90005069": 318, "90005070": 320, "substitute": 3286, "method": 2323, "transportation": 3639, "90005072": 322, "technical rightfulness": 3433, "en suppliers": 1863, "suppliers flexibility": 3314, "terms product": 3486, "suppliers terms": 3315, "terms prearrangements": 3485, "en stock": 1851, "stock turn": 3215, "rate compliance": 2809, "zp 90005069": 3853, "90005069 0001": 319, "capacity problems": 1234, "zp 90005070": 3854, "90005070 0001": 321, "en substitute": 1860, "substitute method": 3287, "method transportation": 2325, "transportation parts": 3640, "parts material": 2488, "zp 90005072": 3855, "90005072 0001": 323, "delivery": 1500, "quantities": 2785, "claimed": 1283, "defective": 1486, "90005093": 324, "penalties": 2509, "failed": 1963, "90005103": 326, "redundant": 2852, "90005105": 328, "welder": 3708, "en orders": 1775, "en delivery": 1687, "instructions 01": 2139, "en releases": 1824, "releases generated": 2904, "systems suppliers": 3339, "suppliers 01": 3312, "releases according": 2902, "quantities parts": 2787, "claimed defective": 1284, "releases goods": 2905, "services 01": 3068, "90005093 0001": 325, "en penalties": 1783, "penalties failed": 2510, "failed deliveries": 1964, "deliveries 01": 1499, "zp 90005103": 3856, "90005103 0001": 327, "sorting redundant": 3127, "redundant stock": 2853, "stock 01": 3205, "zp 90005105": 3857, "90005105 0001": 329, "providing material": 2745, "material welder": 2285, "payment": 2500, "transport": 3636, "organising": 2444, "plants": 2537, "90005238": 330, "handling": 2040, "90005250": 332, "palletisations": 2470, "90005267": 334, "test 01": 3489, "quantity 01": 2789, "en transport": 1885, "transport material": 3638, "en organising": 1777, "special deliveries": 3145, "plants 01": 2538, "zp 90005238": 3858, "90005238 0001": 331, "en quantities": 1819, "quantities packaging": 2786, "packaging handling": 2465, "handling equipment": 2041, "zp 90005250": 3859, "90005250 0001": 333, "en suitable": 1861, "suitable material": 3299, "material palletisations": 2283, "palletisations 01": 2471, "zp 90005267": 3860, "90005267 0001": 335, "skd": 3105, "records": 2833, "shipping": 3077, "warehouse": 3704, "areas": 1131, "90005300": 336, "90005313": 338, "note": 2391, "correctness": 1414, "actual": 1059, "90005324": 340, "skd material": 3106, "foreign based": 1996, "records 01": 2834, "en warehouse": 1895, "en handling": 1725, "areas 01": 1132, "zp 90005300": 3861, "90005300 0001": 337, "stock material": 3210, "zp 90005313": 3862, "90005313 0001": 339, "delivery note": 1503, "note correctness": 2392, "correctness actual": 1416, "actual delivery": 1060, "delivery content": 1501, "content 01": 1378, "zp 90005324": 3863, "90005324 0001": 341, "inbound": 2098, "outbound": 2450, "flows": 1988, "90005353": 342, "90005364": 344, "car": 1236, "levels": 2221, "dealership": 1478, "network": 2374, "stock level": 3208, "storage management": 3221, "material distribution": 2282, "distribution 01": 1561, "zp 90005353": 3864, "90005353 0001": 343, "warehouse material": 3705, "zp 90005364": 3865, "90005364 0001": 345, "stock car": 3206, "car levels": 1237, "levels dealership": 2222, "dealership network": 1479, "network 01": 2375, "warehouses": 3706, "storerooms": 3222, "stocking": 3216, "90005471": 346, "ordering": 2433, "90005568": 348, "pricing": 2598, "90005627": 350, "storerooms 01": 3223, "stocking status": 3217, "status 01": 3194, "regard knock": 2861, "zp 90005471": 3866, "90005471 0001": 347, "en ordering": 1774, "ordering vehicles": 2434, "employees vips": 1609, "zp 90005568": 3867, "90005568 0001": 349, "en correctness": 1671, "correctness pricing": 1418, "pricing reports": 2599, "zp 90005627": 3868, "90005627 0001": 351, "monthly": 2360, "prices": 2595, "comply": 1337, "demo": 1504, "drives": 1586, "customer": 1452, "groups": 2028, "90005711": 352, "registrations": 2877, "mb": 2293, "town": 3582, "hall": 2036, "department": 1506, "90005714": 354, "related expert": 2891, "technical information": 3429, "customers 01": 1456, "en demo": 1688, "demo drives": 1505, "drives customer": 1588, "customer groups": 1453, "groups 01": 2029, "zp 90005711": 3869, "90005711 0001": 353, "en registrations": 1821, "registrations vehicles": 2878, "vehicles mb": 3693, "mb town": 2294, "town hall": 3583, "hall transport": 2037, "transport department": 3637, "department 01": 1507, "zp 90005714": 3870, "90005714 0001": 355, "release": 2897, "sales": 3021, "reporting": 2945, "reception": 2824, "90005772": 356, "publishing": 2749, "portfolio": 2549, "90005803": 358, "consulting": 1366, "service": 3062, "90005873": 360, "release documents": 2899, "reporting 01": 2946, "reception desk": 2825, "technical visual": 3441, "zp 90005772": 3871, "90005772 0001": 357, "en publishing": 1816, "publishing vehicle": 2751, "vehicle portfolio": 3688, "portfolio 01": 2550, "zp 90005803": 3872, "90005803 0001": 359, "en consulting": 1662, "consulting services": 1367, "services service": 3070, "service partners": 3065, "zp 90005873": 3873, "90005873 0001": 361, "improve": 2094, "aftersales": 1083, "agreements": 1092, "marketing": 2272, "accessory": 1036, "90006295": 362, "90006356": 364, "monitoring": 2357, "measures improve": 2302, "technical issues": 3430, "technical product": 3432, "product information": 2641, "technical consulting": 3422, "en drafting": 1702, "en marketing": 1753, "accessory configurations": 1037, "configurations prices": 1360, "prices 01": 2596, "zp 90006295": 3874, "90006295 0001": 363, "product optimisation": 2642, "zp 90006356": 3875, "90006356 0001": 365, "en monitoring": 1763, "monitoring marketing": 2359, "marketing activities": 2273, "activities campaigns": 1055, "events regarding": 1932, "regarding competitor": 2864, "competitor models": 1323, "loyalty": 2241, "preparing": 2576, "ci": 1279, "90006868": 366, "results": 2995, "90006895": 368, "en event": 1711, "en customer": 1677, "customer loyalty": 1454, "presentation events": 2581, "promotional events": 2712, "en preparing": 1794, "preparing new": 2578, "new presentation": 2382, "use ci": 3670, "ci elements": 1280, "elements 01": 1600, "zp 90006868": 3876, "90006868 0001": 367, "loyalty results": 2242, "results 01": 2996, "zp 90006895": 3877, "90006895 0001": 369, "subordinates": 3281, "bu": 1207, "contractor": 1388, "90006945": 370, "90007009": 372, "contractors": 1392, "en information": 1731, "subordinates head": 3282, "bu 01": 1208, "status project": 3200, "project ordering": 2691, "en contractor": 1666, "contractor operations": 1389, "zp 90006945": 3878, "90006945 0001": 371, "exter meetings": 1954, "zp 90007009": 3879, "90007009 0001": 373, "party contractors": 2492, "contractors 01": 1393, "qualification": 2763, "localisation": 2233, "90007107": 374, "price": 2592, "differences": 1545, "gp": 2012, "domestic": 1576, "90007112": 376, "sites 01": 3100, "en qualification": 1817, "qualification programmes": 2764, "projects contractors": 2704, "parts localisation": 2487, "localisation 01": 2234, "zp 90007107": 3880, "90007107 0001": 375, "en price": 1799, "price differences": 2593, "differences orders": 1547, "orders regarding": 2438, "regarding pre": 2870, "series series": 3059, "series products": 3058, "products gp": 2668, "gp domestic": 2014, "domestic production": 1577, "production gp": 2647, "gp 01": 2013, "zp 90007112": 3881, "90007112 0001": 377, "rating": 2812, "evaluation": 1925, "aspects": 1138, "purchase": 2752, "negotiation": 2372, "90007134": 378, "tendering": 3470, "procedures": 2615, "execution": 1940, "framework": 2002, "90007135": 380, "en party": 1779, "rating evaluation": 2813, "evaluation 01": 1926, "en contractors": 1667, "contractors offers": 1395, "terms technical": 3487, "technical aspects": 3417, "aspects 01": 1139, "purchase payment": 2753, "terms 01": 3481, "order proposals": 2432, "price negotiation": 2594, "negotiation inputs": 2373, "zp 90007134": 3882, "90007134 0001": 379, "en tendering": 1874, "tendering procedures": 3473, "procedures execution": 2617, "execution framework": 1941, "framework contracts": 2003, "contracts contractors": 1398, "zp 90007135": 3883, "90007135 0001": 381, "tendering process": 3474, "process 01": 2621, "presenting": 2585, "procured": 2632, "needs": 2370, "teaching": 3385, "fs": 2004, "gs": 2032, "90007159": 382, "90007160": 384, "90007166": 386, "en presenting": 1797, "contractors market": 1394, "providing training": 2746, "teaching equipment": 3390, "parts fs": 2486, "fs gs": 2005, "gs process": 2033, "zp 90007159": 3884, "90007159 0001": 383, "orders contracts": 2437, "contracts agreements": 1397, "agreements 01": 1093, "zp 90007160": 3885, "90007160 0001": 385, "cooperation agreements": 1403, "zp 90007166": 3886, "90007166 0001": 387, "90007208": 388, "90007212": 390, "resources": 2970, "regions": 2873, "90007213": 392, "selection": 3049, "recommendations": 2826, "tooling order": 3563, "promotional items": 2714, "items 01": 2177, "zp 90007208": 3887, "90007208 0001": 389, "zp 90007212": 3888, "90007212 0001": 391, "contractor resources": 1390, "resources defined": 2972, "defined regions": 1494, "regions 01": 2874, "zp 90007213": 3889, "90007213 0001": 393, "contractor selection": 1391, "selection recommendations": 3051, "recommendations 01": 2827, "situation": 3103, "perspective": 2521, "cad": 1223, "designer": 1521, "90007248": 394, "draft": 1579, "designs": 1524, "90007271": 396, "styling": 3275, "90007274": 398, "situation 01": 3104, "selection 01": 3050, "perspective 01": 2522, "en cad": 1645, "cad data": 1224, "designer models": 1522, "zp 90007248": 3890, "90007248 0001": 395, "en draft": 1701, "draft designs": 1580, "designs 01": 1525, "zp 90007271": 3891, "90007271 0001": 397, "engineering styling": 1909, "styling design": 3276, "design cad": 1518, "zp 90007274": 3892, "90007274 0001": 399, "financial": 1977, "individual": 2102, "90007280": 400, "90007281": 402, "90007282": 404, "parts components": 2483, "components 01": 1340, "technological solutions": 3454, "zp 90007280": 3893, "90007280 0001": 401, "design data": 1519, "zp 90007281": 3894, "90007281 0001": 403, "test based": 3490, "based draft": 1177, "draft engineering": 1581, "engineering designs": 1908, "zp 90007282": 3895, "90007282 0001": 405, "post": 2553, "90007304": 406, "composition": 1343, "90007306": 408, "int": 2141, "ext": 1951, "technical solutions": 3438, "solutions technologies": 3123, "new trends": 2387, "en post": 1789, "post test": 2554, "test measures": 3495, "releases parts": 2906, "projects terms": 2710, "zp 90007304": 3896, "90007304 0001": 407, "en concept": 1657, "concept based": 1347, "based parts": 1178, "parts composition": 2484, "composition 01": 1344, "zp 90007306": 3897, "90007306 0001": 409, "cooperation int": 1405, "int ext": 2142, "ext suppliers": 1952, "90007340": 410, "characteristics": 1272, "90007341": 412, "eng": 1904, "jigs": 2178, "technical brief": 3418, "technological efficiency": 3447, "release 01": 2898, "en utilisation": 1890, "zp 90007340": 3898, "90007340 0001": 411, "changes cad": 1268, "data regarding": 1469, "regarding concept": 2865, "concept product": 1348, "product characteristics": 2640, "characteristics 01": 1273, "zp 90007341": 3899, "90007341 0001": 413, "en eng": 1707, "eng design": 1905, "design tools": 1520, "tools jigs": 3568, "jigs 01": 2179, "calculation": 1225, "position": 2551, "testing": 3506, "methodology": 2329, "metrology": 2336, "90007550": 414, "centre": 1254, "90007567": 416, "lab": 2190, "90007577": 418, "strength calculations": 3235, "testing methodology": 3509, "methodology 01": 2330, "en metrology": 1760, "metrology instructions": 2338, "zp 90007550": 3900, "90007550 0001": 415, "metrology centre": 2337, "centre provided": 1256, "provided results": 2736, "results analysis": 2997, "analysis 01": 1101, "zp 90007567": 3901, "90007567 0001": 417, "en lab": 1744, "lab tests": 2191, "zp 90007577": 3902, "component": 1338, "policy": 2545, "90007604": 419, "90007605": 421, "en component": 1656, "tests measurements": 3519, "test vehicle": 3504, "test goals": 3494, "en data": 1681, "en testing": 1876, "testing policy": 3510, "policy methodology": 2546, "zp 90007604": 3903, "90007604 0001": 420, "en group": 1723, "group takeover": 2025, "takeover drives": 3346, "drives 01": 1587, "zp 90007605": 3904, "90007605 0001": 422, "en series": 1836, "production tests": 2659, "corrective": 1412, "comparison": 1315, "90007634": 423, "90007646": 425, "test processes": 3499, "test corrective": 3491, "corrective measures": 1413, "special tests": 3148, "test methods": 3496, "organising competitor": 2445, "competitor model": 1322, "model comparison": 2348, "comparison drives": 1317, "zp 90007634": 3905, "90007634 0001": 424, "en problems": 1802, "problems arising": 2607, "arising tests": 1136, "zp 90007646": 3906, "90007646 0001": 426, "en operation": 1769, "operation test": 2414, "test vehicles": 3505, "conducting": 1356, "90007682": 427, "90007684": 429, "90007688": 431, "road": 3010, "90007689": 433, "testing process": 3511, "takeovers 01": 3348, "en conducting": 1660, "tests parts": 3520, "test drives": 3492, "zp 90007682": 3907, "90007682 0001": 428, "technology tests": 3467, "zp 90007684": 3908, "90007684 0001": 430, "testing schedules": 3512, "zp 90007688": 3909, "90007688 0001": 432, "en road": 1831, "road test": 3011, "zp 90007689": 3910, "90007726": 434, "90007730": 436, "selected": 3047, "90007740": 438, "term test": 3479, "test results": 3503, "zp 90007726": 3911, "90007726 0001": 435, "test process": 3498, "process changes": 2622, "zp 90007730": 3912, "90007730 0001": 437, "tests selected": 3521, "selected parts": 3048, "zp 90007740": 3913, "90007740 0001": 439, "90007834": 440, "supplied": 3306, "90007839": 442, "testing component": 3508, "plans 01": 2536, "test requirements": 3502, "sw updates": 3328, "vehicle check": 3687, "check card": 1275, "card 01": 1239, "zp 90007834": 3914, "90007834 0001": 441, "quality deviations": 2775, "deviations produced": 1537, "produced supplied": 2636, "supplied parts": 3307, "zp 90007839": 3915, "90007839 0001": 443, "quality provided": 2781, "provided services": 2737, "fmea": 1989, "90008000": 444, "paint": 2468, "90008005": 446, "90008007": 448, "new parts": 2381, "requirements set": 2965, "fmea 01": 1990, "quality deviation": 2774, "zp 90008000": 3916, "90008000 0001": 445, "quality performed": 2779, "performed repairs": 2516, "repairs functionality": 2934, "functionality paint": 2007, "paint repairs": 2469, "zp 90008005": 3917, "90008005 0001": 447, "en corrective": 1670, "zp 90008007": 3918, "90008007 0001": 449, "response": 2975, "vs": 3703, "fit": 1982, "90008124": 450, "90008130": 452, "regular": 2879, "90008188": 454, "measures response": 2305, "response defects": 2976, "en audit": 1635, "quality new": 2778, "parts fit": 2485, "fit performance": 1983, "performance 01": 2512, "zp 90008124": 3919, "90008124 0001": 451, "audit 01": 1158, "zp 90008130": 3920, "90008130 0001": 453, "en regular": 1822, "regular 